{
  "backend/main.mo": "Motoko canister implementing user profiles, chat conversations, and WebRTC call signaling with permission checks and access control.",
  "feature_evidence.json": "Feature evidence report mapping authentication-related features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all major frontend files including screens, hooks, and components.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH variables to provide light/dark mode color tokens and global styling.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app and loads the main TypeScript bundle.",
  "frontend/README.md": "Developer documentation outlining project structure, setup steps, and guidance for modifying the app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global providers, wrapping screens in a layout and triggering profile-setup modal logic.",
  "frontend/src/components/CallModal.tsx": "Modal UI for WebRTC calls handling media setup, offer/answer flow, ICE candidates, and polling-based signaling.",
  "frontend/src/components/DeveloperInfoCard.tsx": "Information card showing developer tips, code locations, deployment steps, and a dynamic link to documentation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component allowing users to enter and save name and email, submitting via a mutation with validation and toast feedback.",
  "frontend/src/components/WhatchatLayout.tsx": "Main app layout providing header, navigation, auth-aware controls, and polling-based unread message badge updates.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor and invalidating related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, storing identity, login flow, and related status flags.",
  "frontend/src/hooks/usePollingRefetch.ts": "Hook for interval-based refetching that pauses when the tab is hidden and cleans up timers on unmount.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor chat methods for profiles, conversations, messages, unread counts, and WebRTC signaling.",
  "frontend/src/hooks/useSignOut.ts": "Hook that clears identity, resets queries, sets skip-auto-login marker, and redirects to the home route.",
  "frontend/src/hooks/useWebRTCCall.ts": "Hook managing WebRTC call setup including media initialization, peer connection handling, ICE flow, and call controls.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables for light and dark modes, plus chat wallpaper utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders App.",
  "frontend/src/screens/AuthScreen.tsx": "Handles login flow with Internet Identity, auto-navigation, and a landing screen with feature highlights.",
  "frontend/src/screens/ChatListScreen.tsx": "Displays the user's conversation list with polling, start-chat dialog, and navigation; enforces auth.",
  "frontend/src/screens/ChatThreadScreen.tsx": "Shows messages for a conversation, handles sending, polling, read state, and call initiation; enforces auth.",
  "frontend/src/screens/SettingsScreen.tsx": "Displays profile and principal info with copy actions, and provides sign-out handling; enforces auth.",
  "frontend/src/utils/authBootstrap.ts": "Manages a sessionStorage flag to control skipping auto-login after sign-out.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters (including hash routing), persist them to sessionStorage, retrieve them, and remove them from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s state, versioning, features, and architectural notes for the Whatchat app."
}