{
  "backend/main.mo": "Motoko actor handling user profiles, access control, and 1:1 messaging with conversation storage and message send/query functions.",
  "feature_evidence.json": "Feature evidence report mapping implemented app features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styling with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML shell that mounts the frontend React app via main.tsx.",
  "frontend/README.md": "Developer guide explaining project structure and how to modify and deploy the Whatchat app.",
  "frontend/src/App.tsx": "Main React app routing setup using TanStack Router plus theme and layout providers.",
  "frontend/src/components/DeveloperInfoCard.tsx": "UI card showing developer instructions for editing code and deploying the app, including optional doc link.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal requiring new users to submit name and email before using the app, with backend profile save integration.",
  "frontend/src/components/WhatchatLayout.tsx": "Layout component with header, mobile nav, logout handling, and unread message badge, wrapping child content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, conversations, messages, sending, reading, and unread counts using the actor.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light/dark color palettes and global styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/AuthScreen.tsx": "Login screen offering Internet Identity sign-in and showcasing app features before redirecting authenticated users.",
  "frontend/src/screens/ChatListScreen.tsx": "Displays the user's chat list, allows starting new chats by principal ID, and supports manual refresh of conversation IDs.",
  "frontend/src/screens/ChatThreadScreen.tsx": "Shows messages in a specific conversation, lets users send messages, mark them as read, and manually refresh the thread.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides profile and principal ID display with copy functionality, plus general user settings.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-backed parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, animations, and plugins for the app's UI styling.",
  "project_state.json": "Project metadata describing features, requirements, and current state of the Whatchat app."
}