{
  "backend/main.mo": "Main canister logic defining messaging, profiles, conversations, and call signaling (offers, answers, candidates, status) with access control.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty calls map.",
  "feature_evidence.json": "Evidence report mapping features to frontend files, components, and test IDs for call and WebRTC functionality.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files including components, hooks, screens, and configuration.",
  "frontend/index.css": "Tailwind base styles and OKLCH color theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the root React app and main.tsx script.",
  "frontend/README.md": "Developer documentation outlining project structure, development workflow, and deployment steps.",
  "frontend/src/App.tsx": "Application router setup with layout, authentication, chat screens, settings, and profile setup modal.",
  "frontend/src/components/CallModal.tsx": "Modal UI for WebRTC calls handling media setup, offer/answer flow, ICE candidates, and call controls.",
  "frontend/src/components/DeveloperInfoCard.tsx": "UI card showing developer guidance, code locations, deployment instructions, and documentation link.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects name and email, then saves the user profile via a mutation with success and error toasts.",
  "frontend/src/components/WhatchatLayout.tsx": "App layout providing header, navigation, and logout handling, showing unread chat counts and routing controls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login, logout, and identity loading behavior.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor chat methods for profiles, conversations, messaging, and unread counts.",
  "frontend/src/hooks/useWebRTCCall.ts": "Hook managing WebRTC media setup, peer connection, remote streams, ICE handling, and call controls.",
  "frontend/src/index.css": "Tailwind base styles and custom color/theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and rendering the app.",
  "frontend/src/screens/AuthScreen.tsx": "Displays the login page, redirects authenticated users, and offers Internet Identity sign‑in plus feature highlights.",
  "frontend/src/screens/ChatListScreen.tsx": "Shows the user’s chat list, supports refreshing conversations, and lets users start new chats by entering a Principal ID.",
  "frontend/src/screens/ChatThreadScreen.tsx": "Renders a conversation thread with message send/refresh logic, read marking, and call initiation via WebRTC offer handling.",
  "frontend/src/screens/SettingsScreen.tsx": "Provides user profile info, displays and copies the Principal ID, and shows developer info, redirecting if unauthenticated.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters across routing modes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and plugin setup for the frontend.",
  "project_state.json": "Defines project state, including versioning, high-level app goals, and a list of existing features for the Whatchat messaging app."
}