{
  "kind": "build_request",
  "title": "Add voice call and video call options to Whatchat (non-real-time signaling)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add voice call and video call actions in the 1:1 chat thread UI so a user can start a voice or video call with the other participant in the conversation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ass video call and voice call options"
        ]
      },
      "acceptanceCriteria": [
        "In ChatThreadScreen, the header shows two distinct actions: “Voice call” and “Video call” (icons acceptable).",
        "If the app cannot determine the recipient principal from the conversationId, the call actions are disabled and show an error toast/message on click (English).",
        "Clicking either action opens a call UI (modal or full-screen) that clearly indicates call type (Voice/Video) and the contact identifier (at minimum, the other principal)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement an MVP call experience using WebRTC in the browser with controls for starting, accepting, ending, and handling permission errors for microphone/camera.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ass video call and voice call options"
        ]
      },
      "acceptanceCriteria": [
        "Starting a voice call requests microphone permission; starting a video call requests camera + microphone permissions.",
        "If permission is denied or no device is available, show a clear English error state and allow the user to close the call UI without breaking chat.",
        "The call UI provides at least: End call button; mute/unmute for voice and video calls; camera on/off for video calls.",
        "When a call is ended locally, the UI exits back to the chat thread and cleans up media tracks/peer connection."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add backend support for 1:1 call signaling and call session tracking (offer/answer/ICE candidates and basic call state) so two Whatchat users can establish a WebRTC connection without external services.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ass video call and voice call options"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes call-related APIs to: create/start a call to a receiver principal; fetch call session state by session id; post SDP offer/answer; post ICE candidates; end a call.",
        "All call APIs enforce that only authenticated users with #user permission can access them, and only call participants can read/write signaling data for that call.",
        "Call session data is scoped to exactly two participants (1:1) and cannot be read by other principals.",
        "The backend returns clear error traps/messages for unauthorized access, missing sessions, or invalid participant actions."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add React Query hooks and UI refresh behavior for call signaling that works without real-time transport, using manual refresh and/or short-interval polling while the call UI is open.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "Ass video call and voice call options"
        ]
      },
      "acceptanceCriteria": [
        "New hooks exist in frontend/src/hooks/useQueries.ts for the call signaling operations (create/start, get session, post offer/answer/candidates, end).",
        "While the call UI is open, the app periodically checks for updated signaling/call state (polling) or provides a visible “Refresh” control to progress the call; at least one of these is implemented so calls can connect without WebSockets.",
        "Polling/refresh stops when the call ends or the user closes the call UI.",
        "User-facing text explains that calling may take a moment because it is not real-time (English)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only add backend/migration.mo if an upgrade-safe state migration is truly required.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Do not add WebSockets or any real-time chat/call transport; use request/response + polling/manual refresh only.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Group voice/video calls.",
    "Call recording, call history, missed-call notifications, or push notifications.",
    "Third-party calling/signaling services or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}