{
  "kind": "build_request",
  "title": "Auto-login the last used account on app open",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Implement an automatic sign-in restore flow so that when the app loads and an Internet Identity session/delegation already exists in the browser, the user is automatically taken into the app without needing to click “Sign In with Internet Identity”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add auto login last  acount"
        ]
      },
      "acceptanceCriteria": [
        "When a previously authenticated user revisits/reloads the app and their Internet Identity session is still valid, they are automatically redirected to /chats.",
        "The Auth screen does not require any user interaction to continue when a valid session exists.",
        "If no valid session exists, the Auth screen remains available and the user can sign in normally."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Prevent confusing Auth-screen UI flicker during initial authentication bootstrapping by showing an explicit initialization/loading state until the Internet Identity provider finishes determining whether a session is already authenticated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add auto login last  acount"
        ]
      },
      "acceptanceCriteria": [
        "On a cold load, the app shows a clear loading state (English text) while authentication status is 'initializing'.",
        "The “Sign In with Internet Identity” call-to-action is not shown as the primary action while the app is still determining whether an existing session is present.",
        "Once initialization completes: (a) if authenticated, user is routed into /chats; (b) if not authenticated, the normal sign-in UI is shown."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Ensure the existing “Switch account” / sign-out flow continues to work correctly with auto-login: signing out must clear any locally-stored “last account” indicators used by the UI and must not immediately auto-redirect the user back into /chats unless they explicitly sign in again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add auto login last  acount"
        ]
      },
      "acceptanceCriteria": [
        "After using “Switch account”, the app remains on the Auth screen and does not automatically re-enter /chats without an explicit new sign-in.",
        "Any frontend-persisted “last account” UI hint (if introduced) is cleared on sign-out along with existing auth/query clearing behavior.",
        "Reloading immediately after sign-out does not auto-login the signed-out user."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor (no additional backend services).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers beyond Internet Identity.",
    "Implementing true email verification or password-based authentication.",
    "Adding real-time transport (e.g., WebSockets) for login state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}