{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Whatchat: MVP 1:1 Voice/Video Calling UI (WebRTC + polling signaling)",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add Voice call and Video call actions to the 1:1 chat thread header and open a call UI showing call type and recipient identifier.",
      "acceptanceCriteria": [
        "In ChatThreadScreen, the header shows two distinct actions: “Voice call” and “Video call” (icons acceptable).",
        "If the app cannot determine the recipient principal from the conversationId, the call actions are disabled and show an error toast/message on click (English).",
        "Clicking either action opens a call UI (modal or full-screen) that clearly indicates call type (Voice/Video) and the contact identifier (at minimum, the other principal)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/ChatThreadScreen.tsx",
          "operation": "modify",
          "description": "Add two distinct header actions (Voice call / Video call) using existing UI primitives, resolve the other participant principal from conversationId, disable actions when recipient cannot be determined, and show an English toast on click when disabled; wire actions to open the new Call UI and pass call type + recipient principal identifier. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CallModal.tsx",
          "operation": "create",
          "description": "Create a call UI (modal) that receives call type (voice/video) and recipient principal identifier and renders clear labels for both; expose callbacks for closing/ending the call so ChatThreadScreen can exit cleanly back to the thread. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement an MVP in-browser WebRTC call experience with start/accept/end controls, mute/camera toggles, and permission error handling with proper cleanup.",
      "acceptanceCriteria": [
        "Starting a voice call requests microphone permission; starting a video call requests camera + microphone permissions.",
        "If permission is denied or no device is available, show a clear English error state and allow the user to close the call UI without breaking chat.",
        "The call UI provides at least: End call button; mute/unmute for voice and video calls; camera on/off for video calls.",
        "When a call is ended locally, the UI exits back to the chat thread and cleans up media tracks/peer connection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CallModal.tsx",
          "operation": "modify",
          "description": "Implement WebRTC peer connection lifecycle inside the call UI: request getUserMedia based on call type (mic only vs mic+camera), render local/remote media (at minimum audio; include video elements for video calls), provide controls for End, Mute/Unmute, and Camera On/Off (video calls), show English permission/device error states, and ensure cleanup of MediaStreams/tracks and RTCPeerConnection on end/close/unmount (returning user to chat thread without side effects). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useWebRTCCall.ts",
          "operation": "create",
          "description": "Add a reusable hook to manage WebRTC state for the call UI (peer connection creation, local track enable/disable for mute/camera toggle, attaching remote tracks, teardown/cleanup, and surfacing permission/device errors in English). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChatThreadScreen.tsx",
          "operation": "modify",
          "description": "Ensure ending/closing the call UI returns focus to the chat thread view and that any open-call polling/signaling work is stopped when the call UI is closed. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add React Query hooks for call signaling and implement polling/manual refresh behavior while the call UI is open (non-real-time).",
      "acceptanceCriteria": [
        "New hooks exist in frontend/src/hooks/useQueries.ts for the call signaling operations (create/start, get session, post offer/answer/candidates, end).",
        "While the call UI is open, the app periodically checks for updated signaling/call state (polling) or provides a visible “Refresh” control to progress the call; at least one of these is implemented so calls can connect without WebSockets.",
        "Polling/refresh stops when the call ends or the user closes the call UI.",
        "User-facing text explains that calling may take a moment because it is not real-time (English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend backend interface typings to include the call signaling operations required by the app (create/start call, fetch call session state, post offer/answer/ICE candidates, end call) so new React Query hooks can be typed correctly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add new React Query hooks for call signaling (create/start, get session with optional polling, send offer/answer/candidate, end call). Hooks should depend on the actor from useActor, use English error handling patterns consistent with existing hooks, and support enabling/disabling polling while the call UI is open. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CallModal.tsx",
          "operation": "modify",
          "description": "Wire call signaling hooks into the call UI: start call flow (create/start + send offer), accept flow (send answer), ICE candidate exchange, and add either short-interval polling while open (preferred) and/or a visible 'Refresh' control; ensure polling/refresh is stopped on end/close; include English helper text explaining calling may take a moment because it is not real-time. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}