{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Auto-restore Internet Identity session on load (no flicker)",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Auto-restore an existing Internet Identity session on app load and route authenticated users directly into /chats without requiring a manual sign-in click.",
      "acceptanceCriteria": [
        "When a previously authenticated user revisits/reloads the app and their Internet Identity session is still valid, they are automatically redirected to /chats.",
        "The Auth screen does not require any user interaction to continue when a valid session exists.",
        "If no valid session exists, the Auth screen remains available and the user can sign in normally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/AuthScreen.tsx",
          "operation": "modify",
          "description": "Use the existing Internet Identity auth state (from useInternetIdentity) to automatically navigate to /chats once initialization completes and a valid identity is present; ensure this redirect is gated by an explicit “initializing” state and a one-time sign-out override flag. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChatListScreen.tsx",
          "operation": "modify",
          "description": "Prevent redirect-to-auth during Internet Identity bootstrapping by delaying unauthenticated redirects until initialization is finished; keep the screen inert (or show a loading state) while auth is still initializing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChatThreadScreen.tsx",
          "operation": "modify",
          "description": "Prevent redirect-to-auth during Internet Identity bootstrapping by delaying unauthenticated redirects until initialization is finished; keep the screen inert (or show a loading state) while auth is still initializing. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "modify",
          "description": "Prevent redirect-to-auth during Internet Identity bootstrapping by delaying unauthenticated redirects until initialization is finished; keep the screen inert (or show a loading state) while auth is still initializing. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Show an explicit initialization/loading state during initial authentication bootstrapping to avoid Auth-screen UI flicker.",
      "acceptanceCriteria": [
        "On a cold load, the app shows a clear loading state (English text) while authentication status is 'initializing'.",
        "The “Sign In with Internet Identity” call-to-action is not shown as the primary action while the app is still determining whether an existing session is present.",
        "Once initialization completes: (a) if authenticated, user is routed into /chats; (b) if not authenticated, the normal sign-in UI is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/AuthScreen.tsx",
          "operation": "modify",
          "description": "Render a dedicated 'Initializing authentication…' loading view while useInternetIdentity reports isInitializing; only show the normal 'Sign In with Internet Identity' CTA after initialization completes and the user is not authenticated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChatListScreen.tsx",
          "operation": "modify",
          "description": "Add a small loading state (English text) when auth is initializing to avoid brief flashes/redirect loops during cold loads. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/ChatThreadScreen.tsx",
          "operation": "modify",
          "description": "Add a small loading state (English text) when auth is initializing to avoid brief flashes/redirect loops during cold loads. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/SettingsScreen.tsx",
          "operation": "modify",
          "description": "Add a small loading state (English text) when auth is initializing to avoid brief flashes/redirect loops during cold loads. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Keep “Switch account” (sign-out) working correctly with auto-login by clearing any frontend auto-login hints and preventing immediate re-entry into /chats until the user explicitly signs in again.",
      "acceptanceCriteria": [
        "After using “Switch account”, the app remains on the Auth screen and does not automatically re-enter /chats without an explicit new sign-in.",
        "Any frontend-persisted “last account” UI hint (if introduced) is cleared on sign-out along with existing auth/query clearing behavior.",
        "Reloading immediately after sign-out does not auto-login the signed-out user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSignOut.ts",
          "operation": "modify",
          "description": "Before clearing identity and react-query cache, persist a one-time 'skip auto-login/redirect' marker (sessionStorage) so the UI won’t immediately navigate back into /chats after sign-out; keep existing query clearing + navigation to '/'. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/AuthScreen.tsx",
          "operation": "modify",
          "description": "Respect the one-time 'skip auto-login/redirect' marker: do not auto-navigate to /chats while it is set; clear the marker only when the user explicitly clicks the sign-in button (wrapping login()) or after a successful explicit sign-in. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/authBootstrap.ts",
          "operation": "create",
          "description": "Add small helper utilities for setting/clearing/reading the sessionStorage one-time 'skip auto-login/redirect' marker used by sign-out and the Auth screen to prevent unintended auto-redirect. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}